kumy/Appolo-Matrix-Display-ESP32/src/core/Application.cpp
#include "core/Application.h"

#include <esp32-hal.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>

#include "util/Logger.h"

Application::Application()
    : eventBus_(stats_),
      frontBuffer_(kWidth, kHeight, frontStorage_),
      backBuffer_(kWidth, kHeight, backStorage_),
      demoPage_(clock_, stats_),
      diagnosticsPage_(stats_),
      textPage_(String("LINE1\nLINE2")),
      clockPage_(clock_) {}

void Application::begin() {
  Logger::begin(115200);
  Logger::info(String("matrix-display-2026 scaffold boot"));

  settings_.begin();
  clock_.begin();
  wifi_.begin();
  http_.begin();
  mqtt_.begin();
  ota_.begin();

  display_.begin(settings_.values().display);
  display_.setBrightness(settings_.values().brightness);
  display_.setPower(settings_.values().powerOn);

  activePage_ = &demoPage_;
  activePage_->enter();
  lastFrameAtUs_ = micros();
  lastRenderStartedUs_ = lastFrameAtUs_;
  lastFrameWindowMs_ = millis();

  xTaskCreatePinnedToCore(
      &Application::refreshTaskEntry,
      "DisplayRefresh",
      4096,
      this,
      1,
      &refreshTaskHandle_,
      0);

    // Core 0 is currently dedicated to the refresh task, so the default idle watchdog
    // becomes a false positive until scan timing is moved to a timer-assisted path.
    disableCore0WDT();
}

void Application::tick() {
  const uint32_t nowMs = millis();
  const uint32_t nowUs = micros();

  wifi_.poll();
  http_.poll();
  mqtt_.poll();
  ota_.poll();
  clock_.updateFromMillis(nowMs);

  if ((nowUs - lastRenderStartedUs_) < targetFramePeriodUs_) {
    return;
  }

  const uint32_t renderStartedUs = micros();
  lastRenderStartedUs_ = renderStartedUs;

  activePage_->update(nowMs);
  renderer_.beginFrame(backBuffer_);
  activePage_->draw(renderer_);

  backBuffer_.swap(frontBuffer_);
  const uint32_t renderEndedUs = micros();
  stats_.renderLatencyUs = renderEndedUs - renderStartedUs;

  display_.present(frontBuffer_);

  const uint32_t frameDeltaUs = renderEndedUs - lastFrameAtUs_;
  stats_.frameTimeJitterUs = frameDeltaUs > 16667UL ? (frameDeltaUs - 16667UL) : (16667UL - frameDeltaUs);
  lastFrameAtUs_ = renderEndedUs;
  ++framesThisWindow_;

  if ((nowMs - lastFrameWindowMs_) >= 1000UL) {
    stats_.appFps = framesThisWindow_;
    framesThisWindow_ = 0;
    lastFrameWindowMs_ = nowMs;
  }

  const RuntimeStats& driverStats = display_.stats();
  stats_.refreshHz = driverStats.refreshHz;
  stats_.publishLatencyUs = driverStats.publishLatencyUs;
  stats_.frameLatencyUs = driverStats.frameLatencyUs;
  stats_.droppedPresents += driverStats.droppedPresents;
  stats_.scanUnderruns += driverStats.scanUnderruns;
}

void Application::refreshTaskEntry(void* parameter) {
  static_cast<Application*>(parameter)->refreshTaskLoop();
}

void Application::refreshTaskLoop() {
  for (;;) {
    display_.serviceScan(micros());
  }
}
